## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.runner-neu.module.vnet.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-neu"
      + resource_group_name = "rg-runner-neu"
      + security_rule       = (known after apply)
    }

  # module.runner-neu.module.vnet.azurerm_network_security_rule.allow_https will be created
  + resource "azurerm_network_security_rule" "allow_https" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow_https"
      + network_security_group_name = "nsg-neu"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-runner-neu"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.runner-neu.module.vnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "default"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-runner-neu"
      + virtual_network_name                           = "vnet-neu"
    }

  # module.runner-neu.module.vnet.azurerm_subnet_network_security_group_association.subnet_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.runner-neu.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "vnet-neu"
      + resource_group_name = "rg-runner-neu"
      + subnet              = (known after apply)
    }

  # module.runner-weu.module.vnet.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-weu"
      + resource_group_name = "rg-runner-weu"
      + security_rule       = (known after apply)
    }

  # module.runner-weu.module.vnet.azurerm_network_security_rule.allow_https will be created
  + resource "azurerm_network_security_rule" "allow_https" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow_https"
      + network_security_group_name = "nsg-weu"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-runner-weu"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.runner-weu.module.vnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "20.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "default"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-runner-weu"
      + virtual_network_name                           = "vnet-weu"
    }

  # module.runner-weu.module.vnet.azurerm_subnet_network_security_group_association.subnet_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.runner-weu.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "20.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "vnet-weu"
      + resource_group_name = "rg-runner-weu"
      + subnet              = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>